src/cf/src/Catalogs/НоменклатураКонтрагентов/НоменклатураКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НоменклатураКонтрагентов</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/cf/src/Catalogs/НоменклатураКонтрагентов/Forms/ФормаВыбора/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ВозвращатьСвязь") Тогда
		ВозвращатьСвязь = Параметры.ВозвращатьСвязь;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если ВозвращатьСвязь Тогда
		СтандартнаяОбработка = Ложь;
		ТекСтр = Элементы.Список.ТекущиеДанные;
		Результат = Новый Структура("Ссылка, Номенклатура, Характеристика, Упаковка", ТекСтр.Ссылка, ТекСтр.Номенклатура, ТекСтр.Характеристика, ТекСтр.Упаковка);
		Закрыть(Результат);
	КонецЕсли;	
КонецПроцедуры
